# Constants
major_station = (
    # Wuhan Railway Bureau
    '武汉', '宜昌', '襄阳', '麻城',    '信阳',

    # Beijing
    '北京', '天津',
    '石家庄', '唐山', '秦皇岛', '山海关', '衡水', '邯郸',    '德州',

    # Shanghai
    '上海',
    '杭州', '金华', '宁波', '湖州', '温州',  # '衢州',
    '南京', '徐州', '苏州', '无锡',
    '合肥', '阜阳', '蚌埠', '芜湖', '六安', '铜陵', '安庆', '宣城',

    # Jinan
    '济南', '青岛', '淄博', '菏泽', '聊城', '曲阜', '枣庄',

    # Chengdu
    '成都', '达州',  # '广元',
    '重庆',
    '贵阳', '六盘水',

    # Kunming
    '昆明', '广通',

    # Zhengzhou
    '郑州', '洛阳', '商丘', '新乡', '焦作', '漯河',

    # Guangzhou Railway Group
    '长沙', '株洲', '怀化', '衡阳', '娄底',
    '广州', '深圳', '东莞', '潮汕', '韶关', '珠海',
    '海口', '三亚',

    # Shenyang
    '沈阳', '大连', '丹东', '本溪', '锦州',
    '长春', '吉林', '四平',    '通辽',

    # Harbin
    '哈尔滨', '齐齐哈尔', '牡丹江', '佳木斯',

    # Nanchang
    '南昌', '上饶', '鹰潭', '九江', '赣州', '吉安', '向塘',
    '福州', '厦门', '泉州', '莆田', '漳州', '三明', '龙岩',

    # Nanning
    '南宁', '柳州', '桂林',

    # Xi'an
    '西安', '宝鸡', '安康', '渭南',

    # Lanzhou
    '兰州', '天水', '武威',
    '银川',

    # Qinghai-Tibet Railway Company
    '西宁', '格尔木',
    '拉萨',

    # Urumqi
    '乌鲁木齐', '吐鲁番', '奎屯',

    # Taiyuan
    '太原', '大同', '长治',

    # Hohhot
    '呼和浩特', '包头', '临河', '集宁南',
)
major_station_list = {
    # Wuhan Railway Bureau
    '武汉': ('武昌', '汉口', '武汉'),
    '宜昌': ('宜昌', '宜昌东'),
    '襄阳': ('襄阳', '襄阳东'),  # '襄州'
    '麻城': ('麻城', '麻城北'),
    '信阳': ('信阳', '信阳东'),

    # Beijing
    '北京': ('北京', '北京西', '北京南', '北京东', '北京北', '昌平北', '黄村'),
    '天津': ('天津', '天津西', '天津南', '天津北', '滨海'),
    '石家庄': ('石家庄', '石家庄北', '石家庄东'),
    '唐山': ('唐山', '唐山北', '曹妃甸东', '曹妃甸港'),
    '秦皇岛': ('秦皇岛',),
    '山海关': ('山海关',),
    '衡水': ('衡水', '衡水北'),
    '邯郸': ('邯郸', '邯郸东'),
    '德州': ('德州', '德州东'),

    # Shanghai
    '上海': ('上海', '上海南', '上海虹桥', '上海西', '安亭北'),
    '杭州': ('杭州', '杭州东', '杭州南'),
    '金华': ('金华', '金华南'),
    '宁波': ('宁波', '宁波东'),
    '湖州': ('湖州',),
    '温州': ('温州', '温州南'),
    '南京': ('南京', '南京南'),
    '徐州': ('徐州', '徐州东'),
    '苏州': ('苏州', '苏州北'),
    '无锡': ('无锡', '无锡东'),
    '合肥': ('合肥', '合肥南'),
    '阜阳': ('阜阳',),  # '阜阳西'
    '蚌埠': ('蚌埠', '蚌埠南'),
    '芜湖': ('芜湖',),
    '六安': ('六安',),
    '铜陵': ('铜陵', '铜陵北'),
    '安庆': ('安庆',),
    '宣城': ('宣城',),
    # '衢州'

    # Jinan
    '济南': ('济南', '济南西', '济南东'),  # '大明湖'
    '青岛': ('青岛', '青岛北'),  # '青岛西'
    '淄博': ('淄博', '淄博北'),
    '菏泽': ('菏泽',),
    '聊城': ('聊城',),
    '曲阜': ('曲阜', '曲阜东'),
    '枣庄': ('枣庄', '枣庄西', '枣庄东'),

    # Chengdu
    '成都': ('成都', '成都东', '成都南', '成都西'),
    '达州': ('达州',),
    '重庆': ('重庆', '重庆北', '重庆西', '重庆南', '北碚', '沙坪坝'),
    '贵阳': ('贵阳', '贵阳北', '贵阳东'),
    '六盘水': ('六盘水',),
    # '广元'

    # Kunming
    '昆明': ('昆明', '昆明南', '昆明北'),  # '昆明北' now deprecated (2019.12)
    '广通': ('广通', '广通北'),

    # Zhengzhou
    '郑州': ('郑州', '郑州东', '郑州西'),
    '洛阳': ('洛阳', '洛阳龙门', '关林'),
    '商丘': ('商丘', '商丘南'),  # '商丘东'
    '新乡': ('新乡', '新乡东'),
    '焦作': ('焦作',),
    '漯河': ('漯河', '漯河西'),

    # Guangzhou Railway Group
    '长沙': ('长沙', '长沙南'),
    '株洲': ('株洲', '株洲西'),
    '怀化': ('怀化', '怀化南'),
    '衡阳': ('衡阳', '衡阳东'),
    '娄底': ('娄底', '娄底南'),
    '广州': ('广州', '广州南', '广州东', '广州北', '广州西'),
    '深圳': ('深圳', '深圳北', '深圳东', '深圳西', '福田'),
    '东莞': ('东莞', '东莞东'),
    '潮汕': ('潮汕', '饶平'),
    '韶关': ('韶关', '韶关东'),
    '珠海': ('珠海',),
    '海口': ('海口', '海口东'),
    '三亚': ('三亚',),

    # Shenyang
    '沈阳': ('沈阳', '沈阳北', '沈阳南'),
    '大连': ('大连', '大连北'),
    '丹东': ('丹东',),
    '本溪': ('本溪',),
    '锦州': ('锦州', '锦州南'),
    '长春': ('长春', '长春西'),
    '吉林': ('吉林',),
    '四平': ('四平', '四平东'),
    '通辽': ('通辽',),

    # Harbin
    '哈尔滨': ('哈尔滨', '哈尔滨西', '哈尔滨东', '哈尔滨北'),
    '齐齐哈尔': ('齐齐哈尔', '齐齐哈尔南'),
    '牡丹江': ('牡丹江',),
    '佳木斯': ('佳木斯',),

    # Nanchang
    '南昌': ('南昌', '南昌西'),
    '上饶': ('上饶',),
    '鹰潭': ('鹰潭', '鹰潭北'),
    '九江': ('九江', '庐山'),
    '赣州': ('赣州',),
    '吉安': ('吉安',),
    '向塘': ('向塘',),
    '福州': ('福州', '福州南'),
    '厦门': ('厦门', '厦门北', '厦门高崎'),
    '泉州': ('泉州',),
    '莆田': ('莆田',),
    '漳州': ('漳州', '漳州东'),
    '三明': ('三明', '三明北'),
    '龙岩': ('龙岩',),

    # Nanning
    '南宁': ('南宁', '南宁东'),
    '柳州': ('柳州', '柳江'),
    '桂林': ('桂林', '桂林北'),

    # Xi'an
    '西安': ('西安', '西安北', '西安南'),
    '宝鸡': ('宝鸡', '宝鸡南'),
    '安康': ('安康',),
    '渭南': ('渭南', '渭南北'),

    # Lanzhou
    '兰州': ('兰州', '兰州西'),
    '天水': ('天水', '天水南'),
    '武威': ('武威', '武威南'),
    '银川': ('银川',),

    # Qinghai-Tibet Railway Company
    '西宁': ('西宁',),
    '格尔木': ('格尔木',),
    '拉萨': ('拉萨',),

    # Urumqi
    '乌鲁木齐': ('乌鲁木齐', '乌鲁木齐南'),
    '吐鲁番': ('吐鲁番', '吐鲁番北'),
    '奎屯': ('奎屯',),

    # Taiyuan
    '太原': ('太原', '太原南'),
    '大同': ('大同',),
    '长治': ('长治', '长治北'),

    # Hohhot
    '呼和浩特': ('呼和浩特', '呼和浩特东'),
    '包头': ('包头', '包头东'),
    '巴彦淖尔': ('临河',),
    '乌兰察布': ('集宁南',),
}
