# -*- coding: utf-8 -*-

# Form implementation generated from reading ui file 'all_res_list.ui'
#
# Created by: PyQt5 UI code generator 5.13.0
#
# WARNING! All changes made in this file will be lost!


from PyQt5 import QtCore, QtGui, QtWidgets

all_res_list = [('枣庄', 1014.0, ('K372-K373', 717.0, 717, 528, ('上海', '16:03', '16:03'), ('枣庄西', '00:51', '00:53')), ('K1050-K1051', 297.0, 297, 341, ('枣庄东', '00:29', '00:38'), ('青岛北', '06:10', '06:10'))), ('徐州', 1019.0, ('Z216-Z217', 649.0, 649, 331, ('上海', '18:37', '18:37'), ('徐州', '00:08', '00:29')), ('K1050-K1051', 370.0, 370, 454, ('徐州', '22:36', '22:48'), ('青岛北', '06:10', '06:10'))), ('阜阳', 1174.0, ('K8386-K8387', 581.0, 581, 597, ('上海', '23:13', '23:13'), ('阜阳', '09:10', '09:10')), ('K1050-K1051', 593.0, 593, 719, ('阜阳', '18:11', '18:28'), ('青岛北', '06:10', '06:10'))), ('济南', 1290.0, ('Z268-Z269', 968.0, 968, 580, ('上海', '14:55', '14:55'), ('济南', '00:35', '00:44')), ('K1214-K1215', 322.0, 322, 265, ('济南东', '04:28', '04:42'), ('青岛北', '08:53', '08:53'))), ('合肥', 1381.0, ('K1106-K1107', 567.0, 567, 405, ('上海', '15:04', '15:04'), ('合肥', '21:49', '22:02')), ('K1050-K1051', 814.0, 814, 913, ('合肥', '14:57', '15:16'), ('青岛北', '06:10', '06:10'))), ('芜湖', 1381.0, ('K8418-K8419', 426.0, 426, 365, ('上海', '20:16', '20:16'), ('芜湖', '02:21', '02:27')), ('K1050-K1051', 955.0, 955, 1051, ('芜湖', '12:39', '12:45'), ('青岛北', '06:10', '06:10'))), ('宣城', 1509.0, ('K8418-K8419', 490.0, 490, 436, ('上海', '20:16', '20:16'), ('宣城', '03:32', '03:37')), ('K1050-K1051', 1019.0, 1019, 1115, ('宣城', '11:35', '11:38'), ('青岛北', '06:10', '06:10'))), ('聊城', 1541.0, ('K850', 1092.0, 1092, 961, ('上海', '12:34', '12:34'), ('聊城', '04:35', '04:54')), ('K1214-K1215', 449.0, 449, 399, ('聊城', '02:14', '02:42'), ('青岛北', '08:53', '08:53'))), ('德州', 1582.0, ('Z172-Z173', 1086.0, 1086, 602, ('上海', '19:04', '19:04'), ('德州', '05:06', '05:09')), ('K881-K884', 496.0, 496, 382, ('德州', '02:55', '02:59'), ('青岛北', '09:17', '09:17'))), ('商丘', 1638.0, ('Z252-Z253', 795.0, 795, 475, ('上海', '15:52', '15:52'), ('商丘', '23:47', '23:49')), ('K1025-K1028', 843.0, 843, 648, ('商丘', '20:34', '20:38'), ('青岛北', '07:22', '07:25'))), ('菏泽', 1669.0, ('K1012-K1013', 1061.0, 1061, 837, ('上海', '11:41', '11:41'), ('菏泽', '01:38', '01:42')), ('5025-5028', 608.0, 608, 523, ('菏泽', '22:14', '22:22'), ('青岛北', '06:57', '07:03'))), ('衡水', 1706.0, ('Z268-Z269', 1148.0, 1148, 711, ('上海', '14:55', '14:55'), ('衡水', '02:46', '02:55')), ('K881-K884', 558.0, 558, 443, ('衡水', '01:54', '02:01'), ('青岛北', '09:17', '09:17'))), ('邯郸', 1853.0, ('K234-K235', 1245.0, 1245, 1026, ('上海', '11:10', '11:10'), ('邯郸', '04:16', '04:34')), ('K1214-K1215', 608.0, 608, 557, ('邯郸', '23:36', '23:42'), ('青岛北', '08:53', '08:53'))), ('石家庄', 1970.0, ('Z196-Z197', 1280.0, 1280, 683, ('上海', '18:51', '18:51'), ('石家庄北', '06:14', '06:24')), ('K881-K884', 690.0, 690, 556, ('石家庄北', '00:01', '00:22'), ('青岛北', '09:17', '09:17'))), ('天津', 2040.0, ('Z4022', 1315.0, 1315, 705, ('上海', '19:24', '19:24'), ('天津西', '07:09', '07:14')), ('Z7', 725.0, 725, 424, ('天津西', '23:31', '23:33'), ('青岛北', '06:35', '06:35'))), ('郑州', 2044.0, ('Z216-Z217', 998.0, 998, 521, ('上海', '18:37', '18:37'), ('郑州', '03:18', '03:26')), ('K1025-K1028', 1046.0, 1046, 793, ('郑州', '18:09', '18:20'), ('青岛北', '07:22', '07:25'))), ('唐山', 2288.0, ('Z172-Z173', 1439.0, 1439, 817, ('上海', '19:04', '19:04'), ('唐山', '08:41', '08:45')), ('K1053-K1056', 849.0, 849, 677, ('唐山', '03:42', '03:49'), ('青岛北', '14:59', '14:59'))), ('洛阳', 2292.0, ('Z216-Z217', 1122.0, 1122, 610, ('上海', '18:37', '18:37'), ('洛阳', '04:47', '05:04')), ('K1025-K1028', 1170.0, 1170, 907, ('洛阳', '16:15', '16:18'), ('青岛北', '07:22', '07:25'))), ('北京', 2336.0, ('Z4022', 1463.0, 1463, 819, ('上海', '19:24', '19:24'), ('北京', '09:03', '09:03')), ('Z7', 873.0, 873, 505, ('北京', '22:10', '22:10'), ('青岛北', '06:35', '06:35'))), ('太原', 2420.0, ('Z196-Z197', 1505.0, 1505, 817, ('上海', '18:51', '18:51'), ('太原', '08:28', '08:28')), ('K881-K884', 915.0, 915, 699, ('太原', '21:38', '21:38'), ('青岛北', '09:17', '09:17'))), ('山海关', 2630.0, ('Z172-Z173', 1603.0, 1603, 954, ('上海', '19:04', '19:04'), ('山海关', '10:58', '11:04')), ('K955-K958', 1027.0, 1027, 865, ('山海关', '01:54', '02:00'), ('青岛北', '16:19', '16:19'))), ('渭南', 2954.0, ('Z92-Z93', 1453.0, 1453, 833, ('上海', '18:44', '18:44'), ('渭南', '08:37', '08:39')), ('K1025-K1028', 1501.0, 1501, 1218, ('渭南', '11:04', '11:06'), ('青岛北', '07:22', '07:25'))), ('锦州', 2979.0, ('Z172-Z173', 1768.0, 1768, 1029, ('上海', '19:04', '19:04'), ('锦州南', '12:13', '12:22')), ('K1053-K1056', 1211.0, 1211, 949, ('锦州', '23:10', '23:16'), ('青岛北', '14:59', '14:59'))), ('西安', 3066.0, ('Z92-Z93', 1509.0, 1509, 885, ('上海', '18:44', '18:44'), ('西安', '09:29', '09:29')), ('K1025-K1028', 1557.0, 1557, 1267, ('西安', '10:15', '10:25'), ('青岛北', '07:22', '07:25'))), ('宝鸡', 3379.0, ('T116-T117', 1649.0, 1649, 1120, ('上海', '15:32', '15:32'), ('宝鸡', '10:12', '10:20')), ('K1025-K1028', 1730.0, 1730, 1416, ('宝鸡', '07:46', '07:54'), ('青岛北', '07:22', '07:25'))), ('沈阳', 3435.0, ('Z172-Z173', 1991.0, 1991, 1141, ('上海', '19:04', '19:04'), ('沈阳北', '14:05', '14:11')), ('K969-K972', 1444.0, 1444, 1131, ('沈阳', '21:53', '22:08'), ('青岛北', '16:44', '16:44'))), ('天水', 3689.0, ('T116-T117', 1804.0, 1804, 1222, ('上海', '15:32', '15:32'), ('天水', '11:54', '12:02')), ('K1025-K1028', 1885.0, 1885, 1583, ('天水', '04:59', '05:07'), ('青岛北', '07:22', '07:25'))), ('四平', 3805.0, ('Z172-Z173', 2176.0, 2176, 1237, ('上海', '19:04', '19:04'), ('四平', '15:41', '15:43')), ('K1053-K1056', 1629.0, 1629, 1285, ('四平', '17:34', '17:37'), ('青岛北', '14:59', '14:59'))), ('长春', 4035.0, ('Z172-Z173', 2291.0, 2291, 1297, ('上海', '19:04', '19:04'), ('长春', '16:41', '16:49')), ('K1053-K1056', 1744.0, 1744, 1382, ('长春', '15:57', '16:21'), ('青岛北', '14:59', '14:59'))), ('吉林', 4331.0, ('K516-K517', 2459.0, 2459, 1954, ('上海', '09:16', '09:16'), ('吉林', '17:50', '17:50')), ('K1053-K1056', 1872.0, 1872, 1500, ('吉林', '13:59', '14:17'), ('青岛北', '14:59', '14:59'))), ('兰州', 4385.0, ('T116-T117', 2152.0, 2152, 1472, ('上海', '15:32', '15:32'), ('兰州', '16:04', '16:04')), ('K1025-K1028', 2233.0, 2233, 1886, ('兰州', '23:56', '23:56'), ('青岛北', '07:22', '07:25')))]

class Ui_Form(object):
    def setupUi(self, Form):
        Form.setObjectName("Form")
        Form.resize(800, 600)
        Form.setWindowIcon(QtGui.QIcon('12306.png'))
        self.tableWidget = QtWidgets.QTableWidget(Form)
        self.tableWidget.setGeometry(QtCore.QRect(10, 30, 781, 521))
        self.tableWidget.setObjectName("tableWidget")
        self.tableWidget.setColumnCount(16)
        self.tableWidget.setColumnWidth(0, 82)  # 地名
        self.tableWidget.setColumnWidth(1, 65)  # 代价
        self.tableWidget.setColumnWidth(2, 105)  # 前车车次
        self.tableWidget.setColumnWidth(3, 43)  # 里程
        self.tableWidget.setColumnWidth(4, 43)  # 时间
        self.tableWidget.setColumnWidth(5, 82)  # 发站
        self.tableWidget.setColumnWidth(6, 48)  # 发时
        self.tableWidget.setColumnWidth(7, 82)  # 中转站
        self.tableWidget.setColumnWidth(8, 48)  # 到时
        self.tableWidget.setColumnWidth(9, 105)  # 后车车次
        self.tableWidget.setColumnWidth(10, 43)  # 里程
        self.tableWidget.setColumnWidth(11, 43)  # 时间
        self.tableWidget.setColumnWidth(12, 82)  # 中转站
        self.tableWidget.setColumnWidth(13, 48)  # 发时
        self.tableWidget.setColumnWidth(14, 82)  # 到站
        self.tableWidget.setColumnWidth(15, 48)  # 到时
        self.tableWidget.setHorizontalHeaderLabels(['城市', '代价', '前车车次', '里程', '时间', '发站', '发时', '中转站', '到时', '后车车次', '里程', '时间', '中转站', '发时', '到站', '到时'])  # added
        self.tableWidget.setRowCount(0)
        self.label = QtWidgets.QLabel(Form)
        self.label.setGeometry(QtCore.QRect(10, 10, 431, 16))
        self.label.setObjectName("label")
        self.pushButton = QtWidgets.QPushButton(Form)
        self.pushButton.setGeometry(QtCore.QRect(690, 560, 101, 28))
        self.pushButton.setObjectName("pushButton")
        self.retranslateUi(Form)
        QtCore.QMetaObject.connectSlotsByName(Form)
        self.set_table_content(self.tableWidget, all_res_list)

    def retranslateUi(self, Form):
        _translate = QtCore.QCoreApplication.translate
        Form.setWindowTitle(_translate("Form", "查看所有方案"))
        self.label.setText(_translate("Form", "本系统计算了如下的中转城市，各个城市的计算结果如下表所示："))
        self.pushButton.setText(_translate("Form", "查询选定城市"))

    def set_table_content(self, table, data):
        table.setRowCount(len(data))
        # ('枣庄', 1014.0,
        # ('K372-K373', 717.0, 717, 528, ('上海', '16:03', '16:03'), ('枣庄西', '00:51', '00:53')),
        # ('K1050-K1051', 297.0, 297, 341, ('枣庄东', '00:29', '00:38'), ('青岛北', '06:10', '06:10')))
        # ['城市', '代价', '前车车次', '里程', '时间', '发站', '发时', '中转站', '到时',
        # '后车车次', '里程', '时间', '中转站', '发时', '到站', '到时']
        for i in range(len(data)):
            table.setItem(i, 0, QtWidgets.QTableWidgetItem(str(data[i][0])))
            table.setItem(i, 1, QtWidgets.QTableWidgetItem(str(data[i][1])))
            table.setItem(i, 2, QtWidgets.QTableWidgetItem(str(data[i][2][0])))
            table.setItem(i, 3, QtWidgets.QTableWidgetItem(str(data[i][2][2])))
            table.setItem(i, 4, QtWidgets.QTableWidgetItem(str(data[i][2][3])))
            table.setItem(i, 5, QtWidgets.QTableWidgetItem(str(data[i][2][4][0])))
            table.setItem(i, 6, QtWidgets.QTableWidgetItem(str(data[i][2][4][2])))
            table.setItem(i, 7, QtWidgets.QTableWidgetItem(str(data[i][2][5][0])))
            table.setItem(i, 8, QtWidgets.QTableWidgetItem(str(data[i][2][5][1])))
            table.setItem(i, 9, QtWidgets.QTableWidgetItem(str(data[i][3][0])))
            table.setItem(i, 10, QtWidgets.QTableWidgetItem(str(data[i][3][2])))
            table.setItem(i, 11, QtWidgets.QTableWidgetItem(str(data[i][3][3])))
            table.setItem(i, 12, QtWidgets.QTableWidgetItem(str(data[i][3][4][0])))
            table.setItem(i, 13, QtWidgets.QTableWidgetItem(str(data[i][3][4][2])))
            table.setItem(i, 14, QtWidgets.QTableWidgetItem(str(data[i][3][5][0])))
            table.setItem(i, 15, QtWidgets.QTableWidgetItem(str(data[i][3][5][1])))


if __name__ == '__main__':
    import sys
    app = QtWidgets.QApplication(sys.argv)
    MainWindow = QtWidgets.QMainWindow()
    ui = Ui_Form()
    ui.setupUi(MainWindow)
    MainWindow.show()
    sys.exit(app.exec_())

